In [3]:
import numpy as np
import pandas as pd

In [7]:
days = ['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2']
meals = ['meal1','meal2','meal3','meal1','meal2','meal3']
hier_index = list(zip(days, meals))
hier_index

[('Day 1', 'meal1'),
 ('Day 1', 'meal2'),
 ('Day 1', 'meal3'),
 ('Day 2', 'meal1'),
 ('Day 2', 'meal2'),
 ('Day 2', 'meal3')]

In [8]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
arr_3 = np.random.randint(500, 700, size=(6,2))
df_4 = pd.DataFrame(arr_3, hier_index, ['M', 'F'])
print(df_4)

               M    F
Day 1 meal1  576  579
      meal2  563  594
      meal3  560  620
Day 2 meal1  580  654
      meal2  566  557
      meal3  543  632

In [9]:
df_4.loc['Day 1']

         M    F
meal1  576  579
meal2  563  594
meal3  560  620

In [15]:
df_4.loc['Day 1'].loc['meal1']['M']

576

In [16]:
df_4.index.names = ['Day', 'Meal']
df_4

               M    F
Day   Meal
Day 1 meal1  576  579
      meal2  563  594
      meal3  560  620
Day 2 meal1  580  654
      meal2  566  557
      meal3  543  632

In [17]:
df_4.xs('Day 2')

         M    F
Meal
meal1  580  654
meal2  566  557
meal3  543  632

In [20]:
# df_4.xs(1, level='Meal')

In [21]:
dict_4 = {'A':['Day 1', 'Day 1', 'Day 1', 'Day 2', 'Day 2', 'Day 2'],
          'B': [1,2,3,1,2,3],
          'C':['M', 'F', 'M', 'F', 'M', 'F'],
          'D': [1,2,3,4,5,6]}
df_5 = pd.DataFrame(dict_4)
df_5.pivot_table(values='D', index=['A', 'B'], columns='C')

C          F    M
A     B
Day 1 1  NaN  1.0
      2  2.0  NaN
      3  NaN  3.0
Day 2 1  4.0  NaN
      2  NaN  5.0
      3  6.0  NaN